<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"prod","backend":"eaecea35c9d1dc9ea5eb33f1284463c82d2353e89f101ac668f5ac51bb8ae1d6","plan_job_ref":"Job Build and Deploy #6 at https://github.com/swibrow/actions-playground/actions/runs/8534737810","plan_out_hash":"545df8dc579e204d56a3962ae4e916d6917b616d5620d4689d7ce6e675f09c72","plan_hash":"c7fac35dc45d3bd6bf20c82d3aa351c9afcc7355aedcef32643bd562e8f21ca8","plan_text_format":"diff","version":"1.42.0"} -->
Terraform plan for __prod__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)

Warning: Value for undeclared variable

The root module does not declare a variable named "image_tag" but a value was
found in file "/tmp/variables.tfvars". If you meant to use this value, add a
"variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.
```
</details>

:memo: Plan generated in [Build and Deploy #6](https://github.com/swibrow/actions-playground/actions/runs/8534737810)